"use client";
import React from "react";
import Image from "next/image";
function CoInformation() {
  return (
    <div className="py-5 px-8">
      <div className="flex justify-center items-center">
        <Image src="/assets/co2.jpg" alt="AQI" width={600} height={400} />
      </div>
      <div className="py-5 px-8">
        <p className="text-2xl font-bold">CO2 คืออะไร?</p>
        <p className="text-xl py-3">
          คาร์บอนไดออกไซด์เป็นแก๊สที่มีอยู่ทั่วไปในบรรยากาศ
          แก๊สนี้มีบทบาทสำคัญต่อการดำรงชีพของทั้งมนุษย์ สัตว์ และพืช
          เป็นสารตั้งต้นที่พืชใช้ผลิตอาหารโดยกระบวนการสังเคราะห์แสง
          ในด้านอุตสาหกรรมนั้น คาร์บอนไดออกไซด์ถูกนำมาใช้ประโยชน์ในหลายๆ ด้าน
          โอกาสการเกิดพิษของแก๊สชนิดนี้ ในการทำงานโดยปกติมีโอกาสเกิดขึ้นได้น้อย
          อย่างไรก็ตามหากได้รับแก๊สนี้เข้าไปในปริมาณมาก จะทำให้หายใจเร็ว
          ชีพจรเร็ว หัวใจเต้นเร็ว กดสมอง ซึม มึนงง สับสน หมดสติ
          และอาจเสียชีวิตได้
        </p>
        <div className="py-5 ">
          <p className="text-2xl font-bold">ลักษณะทางกายภาพ</p>
          <p className="text-xl py-2">
            ในสภาวะปกติจะเป็นแก๊ส ไม่มีสี ไม่มีกลิ่น ไม่มีรส หนักกว่าอากาศ
            หากถูกอัดด้วยความดันและทำให้เย็นลง จะอยู่ในสถานะของเหลวและของแข็งได้
            ถ้าอยู่ในรูปของเหลว จะเรียกว่าคาร์บอนไดออกไซด์เหลว (Liquid carbon
            dioxide) ถ้าอยู่ในรูปของแข็งเป็นผลึกเย็น จะเรียกว่าน้ำแข็งแห้ง (Dry
            ice)
          </p>
        </div>
        <div className="py-5">
          <p className="text-2xl font-bold">
            อันตรายและผลกระทบต่อสุขภาพจาก CO₂
          </p>
          <p className="text-xl py-2">
            แก๊สคาร์บอนไดออกไซด์ก่อโรคได้ทางหนึ่งโดยการแทนที่ออกซิเจน
            (Asphyxiant) ทำให้ออกซิเจนในอากาศมีไม่พอ
            จึงเกิดพิษจากภาวะออกซิเจนในเลือดต่ำ (Hypoxia) ขึ้นได้
            การที่มีคาร์บอนไดออกไซด์คั่งในเลือด (Hypercapnia)
            ไม่ว่าจะจากการขาดออกซิเจนหรือได้รับคาร์บอนไดออกไซด์เข้าไปมากก็ตาม
            จะทำให้เลือดเป็นกรด (Acidosis) เกิดการขยายตัวของหลอดเลือด
            กระตุ้นระบบหายใจให้หายใจเร็วขึ้น ทำให้หัวใจเต้นเร็ว และกดสมอง
            สำหรับกลไกการก่อโรคในกรณีคาร์บอนไดออกไซด์เหลวกับน้ำแข็งแห้งนั้น
            จะก่ออันตรายจากความเย็นจัด
            ซึ่งสามารถกัดกร่อนเนื้อเยื่อผิวหนังส่วนที่สัมผัส
            ทำให้เกิดเนื้อตายได้
          </p>
        </div>
      </div>
    </div>
  );
}

export default CoInformation;
