"use client";

import React from "react";
import Image from "next/image";
function Dust() {
  return (
    <div className=" py-5 px-8">
      <div className="flex justify-center items-center">
        <Image src="/assets/pm25.jpg" alt="AQI" width={600} height={400} />
      </div>
      <div className="py-5 px-8">
        <p className="text-2xl font-bold">ฝุ่นละออง คืออะไร?</p>
        <p className="text-xl py-3">
          ฝุ่นละออง คือ
          อนุภาคของแข็งขนาดเล็กหรือละอองของเหลวที่แขวนลอยอยู่ในอากาศ
          เกิดขึ้นได้ทั้งจากธรรมชาติ เช่น ทราย ดิน ไอน้ำ เขม่าควันจากไฟป่า
          และเกิดจากกิจกรรมของมนุษย์ เช่น ควันจากการจราจร ฝุ่นจากงานก่อสร้าง
          ฝุ่นจากการโม่หิน ฝุ่นจากการเผาถ่านหินเพื่อผลิตไฟฟ้า
          หรือกิจกรรมในครัวเรือนอื่น ๆ
          ฝุ่นเหล่านี้เมื่อถูกกระแสลมพัดก็จะปลิวกระจายตัว
          ฝุ่นบางชนิดเล็กมีขนาดเล็กมากจนมองไม่เห็นด้วยตาเปล่า
        </p>
      </div>
      <div className="py-5 px-8">
        <p className="text-2xl font-bold">อันตรายที่เกิดจากฝุ่น</p>
        <p className="text-xl py-3">
          ระดับความอันตรายของฝุ่นนั้น
          ขนาดอนุภาคของฝุ่นก็เป็นปัจจัยที่สำคัญเช่นกัน นั่นคือ
          หากฝุ่นมีอนุภาคขนาดใหญ่อาจก่อให้เกิดความเดือดร้อนรำคาญต่อผิวกาย
          แต่หากฝุ่นนั้นมีอนุภาคขนาดเล็กกว่า 10 ไมครอนแล้ว
          จะสามารถผ่านการกรองของขนจมูกเข้าไปสะสมตัว ในระบบทางเดินหายใจ
          และถ้าฝุ่นอนุภาคขนาดเล็กกว่านั้นและมีสารพิษเป็นองค์ประกอบด้วยแล้ว
          จะสามารถทำให้เกิดโรคระบบทางเดินหายใจ
          หรือส่งผลเสียต่อประสิทธิภาพการทำงานของปอดได้
        </p>
      </div>
      <div className="py-5 px-8">
        <p className="text-2xl font-bold">
          แนวทางการป้องกันภัยร้ายใกล้ตัวอย่างง่าย
        </p>
        <p className="text-xl py-3">
          หมั่นปัดกวาดเช็ดถูทำความสะอาดที่อยู่ให้ปราศจากฝุ่น
          หลีกเลี่ยงบริเวณที่มีฝุ่นและควัน
          หากหลีกเลี่ยงไม่ได้ควรสวมหน้ากากป้องกันฝุ่น
          หากคุณภาพอากาศเป็นอันตรายต่อสุขภาพ ควรหลีกเลี่ยงการทำกิจกรรมในกลางแจ้ง
        </p>
      </div>
    </div>
  );
}

export default Dust;
