"use client";

import Image from "next/image";
import React from "react";

function PmInformation() {
  return (
    <div className=" py-5 px-8">
      <div className="flex justify-center items-center">
        <Image src="/assets/pm251.png" alt="AQI" width={600} height={400} />
      </div>
      <div className="py-5 px-8">
        <p className="text-2xl font-bold">PM2.5 คืออะไร?</p>
        <p className="text-xl py-3">
          PM2.5 คือ ฝุ่นละอองขนาดเล็กไม่เกิน 2.5 ไมครอน เทียบได้ว่ามีขนาดประมาณ
          1 ใน 25 ส่วนของเส้นผ่านศูนย์กลางเส้นผมมนุษย์
          เล็กจนขนจมูกของมนุษย์ที่ทำหน้าที่กรองฝุ่นนั้นไม่สามารถกรองได้
          จึงแพร่กระจายเข้าสู่ทางเดินหายใจ กระแสเลือด และเข้าสู่อวัยอื่น ๆ
          ในร่างกายได้ ตัวฝุ่นเป็นพาหะนำสารอื่นเข้ามาด้วย เช่น แคดเมียม ปรอท
          โลหะหนัก และสารก่อมะเร็งอื่น ๆ
        </p>
      </div>
      <div className="py-5 px-8">
        <p className="text-2xl font-bold">สาเหตุที่ทำให้เกิดฝุ่น PM2.5</p>
        <p className="text-xl py-2">
          ฝุ่นละอองขนาดไม่เกิน 2.5 ไมครอน (PM2.5) มาจากสองแหล่งกำเนิดใหญ่ๆ คือ
        </p>
        <p className="text-xl ">
          1.แหล่งกำเนิดโดยตรง ได้แก่ การเผาในที่โล่ง การคมนาคมขนส่ง การผลิตไฟฟ้า
          อุตสาหกรรมการผลิต
        </p>
        <p className="text-xl ">
          2.การรวมตัวของก๊าซอื่นๆ ในบรรยากาศ โดยเฉพาะซัลเฟอร์ไดออกไซด์ (SO2)
          และออกไซด์ของไนโตรเจน (NOx) รวมทั้งสารพิษอื่นๆ
          ที่ล้วนเป็นอันตรายต่อร่างกายมนุษย์ เช่น สารปรอท (Hg), แคดเมียม (Cd),
          อาร์เซนิก (As) หรือโพลีไซคลิกอะโรมาติกไฮโดรคาร์บอน (PAHs)
        </p>
      </div>
      <div className="py-5 px-8">
        <p className="text-2xl font-bold">
          อันตรายและผลกระทบต่อสุขภาพจาก PM2.5
        </p>
        <p className="text-xl py-2">
          ร่างกายของผู้ที่แข็งแรงเมื่อได้รับฝุ่น PM2.5
          อาจจะไม่ส่งผลกระทบให้เห็นในช่วงแรกๆ แต่หากได้รับติดต่อกันเป็นเวลานาน
          หรือสะสมในร่างกาย สุดท้ายก็จะก่อให้เกิดอาการผิดปกติของร่างกายในภายหลัง
          โดยแบ่งได้เป็นผลกระทบทางร่างกาย และผลกระทบทางผิวหนัง
        </p>
        <p className="text-xl font-bold">ผลกระทบทางสุขภาพ</p>
        <p className="text-xl px-10 py-2">เกิดอาการไอ จาม หรือภูมิแพ้</p>
        <p className="text-xl px-10 py-2">
          ผู้ที่เป็นภูมิแพ้ฝุ่นอยู่แล้ว จะยิ่งถูกกระตุ้นให้เกิดอาการมากขึ้น
        </p>
        <p className="text-xl px-10 py-2">เกิดโรคทางเดินหายใจเรื้อรัง</p>
        <p className="text-xl px-10 py-2">เกิดโรคหลอดเลือดและหัวใจเรื้อรัง</p>
        <p className="text-xl px-10 py-2">เกิดโรคปอดเรื้อรัง หรือมะเร็งปอด</p>
        <p className="text-xl font-bold">ผลกระทบทางผิวหนัง</p>
        <p className="text-xl px-10 py-2">มีผื่นคันตามตัว</p>
        <p className="text-xl px-10 py-2">ปวดแสบปวดร้อน มีอาการระคายเคือง</p>
        <p className="text-xl px-10 py-2">
          เป็นลมพิษ ถ้าเป็นหนักมากอาจเกิดลมพิษบริเวณใบหน้า ข้อพับ ขาหนีบ
        </p>
        <p className="text-xl px-10 py-2">
          ทำร้ายเซลล์ผิวหนัง ทำให้ผิวอ่อนแอ เหี่ยวย่นง่าย
        </p>
      </div>
    </div>
  );
}

export default PmInformation;
